/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Не вдалося завершити операцію";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Сталася невідома помилка (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Не вдається завершити дію";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Спробуйте пізніше.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Не вдається записати";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Спробуйте записати ще раз.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Не вдається записати";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Зупиніть усі інші дії, які використовують %@, і повторіть спробу."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Не вдається записати";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Спробуйте записати ще раз.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Записування зупинено";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Спробуйте записати ще раз.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Операцію зупинено";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Замало вільного місця, щоб продовжувати записування файлу. Звільніть місце, видаливши наявні фото або відео.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Записування зупинено";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Спробуйте записати ще раз.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Записування зупинено";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Спробуйте записати ще раз.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Записування зупинено";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Досягнуто максимальну тривалість запису."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Записування зупинено";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Досягнуто максимальний розмір запису."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Записування зупинено";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Зупиніть усі інші дії, які використовують записувальний пристрій, і повторіть спробу.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Записування зупинено";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Досягнуто максимальну тривалість запису."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Не вдається записати";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Спробуйте записати ще раз.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Не вдається використати %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Зупиніть усі інші дії, які використовують %@, і повторіть спробу."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Не вдається використати %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Зупиніть усі інші дії, які використовують %@, і повторіть спробу."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Записування зупинено";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Зупиніть усі інші дії, які використовують записувальний пристрій, і повторіть спробу.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Не вдається завершити дію";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Спробуйте пізніше.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Не вдається завершити експорт";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Спробуйте експортувати ще раз.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Помилка розшифрування";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Не вдалося розшифрувати мультимедійні дані. Можливо, вони пошкоджені.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Не вдається відкрити";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Непідтримуваний формат мультимедійного файлу.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Не вдається зберегти";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Спробуйте зберегти ще раз.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Не вдається відкрити";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Не вдається використати цей мультимедійний файл.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Не вдається відкрити";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Не вдається використати цей мультимедійний файл.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Не вдається відкрити";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Не вдається використати цей мультимедійний файл.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Не вдається відкрити";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Не вдається використати цей мультимедійний файл.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Не вдається відкрити";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Непідтримуваний формат мультимедійного файлу.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Не вдається відкрити";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Можливо, мультимедійний файл пошкоджено.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Не вдається зробити знімок";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Спробуйте зробити знімок ще раз.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Операцію зупинено";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Ця операція недоступна для захищеного вмісту."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Не вдається відкрити";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Немає дозволу на цей вміст."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Не вдається відкрити";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Ця програма не має прав на відтворення цього файлу."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Не вдається відкрити";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Не вдається використати цей мультимедійний файл.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Помилка розшифрування";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Декодер для цього медіафайлу не знайдено.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Помилка шифрування";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Кодер для цього медіафайлу не знайдено.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Помилка розшифрування";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Декодер для цього медіафайлу зайнятий.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Зупиніть усі інші дії, які розшифровують медіавміст, і повторіть спробу.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Помилка шифрування";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Кодер для цього медіафайлу зайнятий.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Зупиніть усі інші дії, які шифрують медіавміст, і повторіть спробу.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Не вдається використати %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "«%@» не може використовуватися програмою у фоновому режимі."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Операцію зупинено";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Операція недоступна для цього медіафайлу.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Операцію зупинено";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Не вдалося створити відео за наданими інструкціями.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Не вдається відкрити";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Не вдається використати цей мультимедійний файл.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Операцію зупинено";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Не вдається вжити файл кешу за URL-адресою місця завантаження.";
